In [1]:
import pandas as pd
import numpy as np

In [2]:
dictionary = {"Istanbul":[25,35,np.nan],
             "Ankara" :[15,np.nan,35],
             "Izmir":[27,12,5]}

In [3]:
df = pd.DataFrame(dictionary)

In [4]:
df

   Istanbul  Ankara  Izmir
0      25.0    15.0     27
1      35.0     NaN     12
2       NaN    35.0      5

In [5]:
df.dropna()

   Istanbul  Ankara  Izmir
0      25.0    15.0     27

In [6]:
df.dropna(axis=1)

   Izmir
0     27
1     12
2      5

In [7]:
dictionary = {"Istanbul":[25,35,np.nan],
             "Ankara" :[15,np.nan,35],
             "Izmir":[27,12,5],
             "Elazig":[np.nan,6,np.nan]}

In [8]:
df = pd.DataFrame(dictionary)

In [9]:
df

   Istanbul  Ankara  Izmir  Elazig
0      25.0    15.0     27     NaN
1      35.0     NaN     12     6.0
2       NaN    35.0      5     NaN

In [11]:
df.dropna()

Empty DataFrame
Columns: [Istanbul, Ankara, Izmir, Elazig]
Index: []

In [12]:
df.dropna(axis=1)

   Izmir
0     27
1     12
2      5

In [14]:
df.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      25.0    15.0     27
1      35.0     NaN     12
2       NaN    35.0      5

In [15]:
df

   Istanbul  Ankara  Izmir  Elazig
0      25.0    15.0     27     NaN
1      35.0     NaN     12     6.0
2       NaN    35.0      5     NaN

In [16]:
df.fillna(15)

   Istanbul  Ankara  Izmir  Elazig
0      25.0    15.0     27    15.0
1      35.0    15.0     12     6.0
2      15.0    35.0      5    15.0

## groupby

In [3]:
import pandas as pd
import numpy as np

In [4]:
maasSozlugu = {"Departman":["Yazılım","Yazılım","Hukuk","Hukuk","IK","IK"],
              "Calisanlar":["Ahmet","Mehmet","Ali","Veli","Can","Mert"],
              "Maaslar":[1500,2000,3000,4000,5000,6000]}

In [5]:
maasSozlugu

{'Departman': ['Yazılım', 'Yazılım', 'Hukuk', 'Hukuk', 'IK', 'IK'],
 'Calisanlar': ['Ahmet', 'Mehmet', 'Ali', 'Veli', 'Can', 'Mert'],
 'Maaslar': [1500, 2000, 3000, 4000, 5000, 6000]}

In [6]:
yeniDf = pd.DataFrame(maasSozlugu)

In [8]:
group = yeniDf.groupby("Departman")

In [10]:
group.mean()

           Maaslar
Departman
Hukuk       3500.0
IK          5500.0
Yazılım     1750.0

In [11]:
group.count()

           Calisanlar  Maaslar
Departman
Hukuk               2        2
IK                  2        2
Yazılım             2        2

In [12]:
group.max()

          Calisanlar  Maaslar
Departman
Hukuk           Veli     4000
IK              Mert     6000
Yazılım       Mehmet     2000

In [13]:
group.min()

          Calisanlar  Maaslar
Departman
Hukuk            Ali     3000
IK               Can     5000
Yazılım        Ahmet     1500

In [14]:
group.describe()

          Maaslar
            count    mean         std     min     25%     50%     75%     max
Departman
Hukuk         2.0  3500.0  707.106781  3000.0  3250.0  3500.0  3750.0  4000.0
IK            2.0  5500.0  707.106781  5000.0  5250.0  5500.0  5750.0  6000.0
Yazılım       2.0  1750.0  353.553391  1500.0  1625.0  1750.0  1875.0  2000.0